InformationRegisters/атл_НастройкиПодсистемыУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_НастройкиПодсистемыУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогинОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьСинхронизацииССервером</Name>
					<Comment>Периодичность синхронизации с сервером в секундах (минимум 10 секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательДляВыполненияОбменаДанными</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованиеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийКлючШифрования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_КлючиШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФоновыйРежимОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщенияОПакетахОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьСтатистикуОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверкаДанныхОВыполненныхРаботахВЗадачеМобильномуСотруднику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонЗаполненияЗадачМобильнымСотрудникам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_ШаблоныЗаполненияЗадачМобильнымСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУказанияДатыНазначенияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_СпособУказанияДатыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиротаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолготаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочекВебКлиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойЛогин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/атл_НастройкиПодсистемыУМС/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервыйЗапуск = Параметры.ПервыйЗапуск;
	
	мНастройкиПодсистемыУМС = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	мНастройкиПодсистемыУМС.Прочитать();
	
	ЗаполнитьЗначенияСвойств(Запись, мНастройкиПодсистемыУМС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	Закрыть();
	
	Если ПервыйЗапуск Тогда
		ОткрытьФорму("Обработка.атл_НастройкаОбменаДаннымиУМС.Форма.Форма");	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	мНастройкиПодсистемыУМС = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(мНастройкиПодсистемыУМС, ЭтаФорма.Запись);
	
	мНастройкиПодсистемыУМС.Записать();	
	
КонецПроцедуры


&НаКлиенте
Процедура Местонахождение(Команда)
	
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаПараметровОткрытия", АдресТаблицы);
	ПараметрыФормы.Вставить("НеИнтерактивноеОткрытие", Истина);
	ПараметрыФормы.Вставить("ВводКоординаты", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", "Адрес организации");
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработкаВводаКоординат", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.атл_ОтображениеТочекСТрекомНаКарте.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, ОповещениеФормы);

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТаблицаПараметровОткрытия = атл_УправлениеМобильнымиСотрудникамиСервер.СформироватьТаблицуСписокПараметровОткрытияДляОткрытияКарты();
	
	мНоваяСтрока = ТаблицаПараметровОткрытия.Добавить();
	мНоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	Если ЗначениеЗаполнено(Запись.ШиротаАдресОрганизации) И ЗначениеЗаполнено(Запись.ДолготаАдресОрганизации) Тогда
		мНоваяСтрока.ВидОбъекта = "ТочкаНаКарте";	
		мНоваяСтрока.Широта = Запись.ШиротаАдресОрганизации;
		мНоваяСтрока.Долгота = Запись.ДолготаАдресОрганизации;
	Иначе
		мНоваяСтрока.ВидОбъекта = "АдресДляПоискаНаКарте";	
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОткрытия, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВводаКоординат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("Строка") И НЕ РезультатЗакрытия = "" тогда
		НайденныйРазделитель = Найти(РезультатЗакрытия, ";");
		Если НайденныйРазделитель > 0 Тогда
			Запись.ДолготаАдресОрганизации = Сред(РезультатЗакрытия, 1, НайденныйРазделитель - 1);
			Запись.ШиротаАдресОрганизации = Сред(РезультатЗакрытия, НайденныйРазделитель + 1);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
